<a id="A"></a>
# <b>A. <span style='color:#0B2F9F'><code>AGGREGATION</code></b>

Fungsi agregat atau <b>Aggregation</b> adalah fungsi yang melakukan perhitungan pada sekumpulan nilai dan mengembalikan satu nilai hasil perhitungan tersebut. Fungsi agregat SQL yang paling umum digunakan adalah:
<br><br>
<table border="1">
    <tr>
        <th>Fungsi Agregat</th>
        <th>Deskripsi</th>
    </tr>
    <tr>
        <td><b>MIN( )</b></td>
        <td>Mengembalikan <span style='color:#FFB200'>nilai terkecil</span> dalam kolom yang dipilih.</td>
    </tr>
    <tr>
        <td><b>MAX( )</b></td>
        <td>Mengembalikan <span style='color:#FFB200'>nilai terbesar</span> dalam kolom yang dipilih.</td>
    </tr>
    <tr>
        <td><b>COUNT( )</b></td>
        <td>Mengembalikan <span style='color:#FFB200'>jumlah baris</span> dalam suatu set</td>
    </tr>
    <tr>
        <td><b>SUM( )</b></td>
        <td>Mengembalikan <span style='color:#FFB200'>jumlah total</span> dari kolom numerik.</td>
    </tr>
    <tr>
        <td><b>AVG( )</b></td>
        <td>Mengembalikan <span style='color:#FFB200'>nilai rata-rata</span> dari kolom numerik.</td>
    </tr>
</table>

#### <i><b><span style='color:#55679C'>Quest</span> : Hitung banyak data pada tabel telco_services!</b></i>

In [ ]:
SELECT COUNT(*) AS banyak_data
FROM telco_churn.telco_services

#### <i><b><span style='color:#55679C'>Quest</span> : Hitung dan tampilkan total_revenue pada  tabel telco_services yang didapat perusahaan!</b></i>

In [ ]:
SELECT ROUND(SUM(total_revenue),2) AS total_revenue
FROM telco_churn.telco_services

* ROUND(nama_kolom, jumlah angka) merupakan fungsi pembulatan bilangan desimal

#### <i><b><span style='color:#55679C'>Quest</span> : Hitung dan tampilkan nilai minimum, nilai maksimum dan rata-rata kolom tenure_in_months pada tabel telco_services dan beri nama alias yang sesuai!</b></i>

In [ ]:
SELECT
    MIN(tenure_in_months) AS min_tenure_in_month,
    MAX(tenure_in_months) AS max_tenure_in_month,
    ROUND(AVG(tenure_in_months),2) AS avg_tenure_in_month
FROM telco_churn.telco_services

#### <i><b><span style='color:#55679C'>Quest</span> : Buat 3 kolom yang diberi total_offer_A_or_B, total_offer_C_or_D_or_E dan non_offer yang merupakan perhitungan</b></i>
<ul>
<li>total_offer_A_or_B = Jumlah customer yang mendapatkan penawaran Offer A atau Offer B</li>
<li>total_offer_C_or_D_or_E = Jumlah customer yang mendapatkan penawaran Offer C, Offer D atau Offer A</li>
<li>non_offer = Jumlah customer yang tidak mendapatkan penawaran</li>
</ul>

In [ ]:
SELECT
  SUM(CASE WHEN offer IN ('Offer A','Offer B') THEN 1 ELSE 0 END) AS total_offer_A_or_B,
  SUM(CASE WHEN offer IN ('Offer C','Offer D','Offer E') THEN 1 ELSE 0 END) AS total_offer_C_or_D_or_E,
  SUM (CASE WHEN offer IS NULL THEN 1 ELSE 0 END) AS non_offer
FROM telco_churn.telco_services

Query lain dengan hasil yang sama:

SELECT
  COUNT(CASE
        WHEN offer IN ("Offer A","Offer B")
        THEN offer
        END) as total_offer_A_or_B,
  COUNT(CASE
        WHEN offer IN ("Offer C","Offer D","Offer E")
        THEN offer
        END) as total_offer_C_or_D_or_E,
  COUNT(CASE
        WHEN offer IS NULL THEN 1
        END) as non_offer
FROM `telco_churn.telco_services`

<a id="B"></a>
# <b>B. <span style='color:#0B2F9F'><code>GROUP BY</code></b>

Fungsi agregat sering digunakan bersama dengan klausa GROUP BY pada pernyataan SELECT. Klausa GROUP BY membagi hasil query menjadi beberapa kelompok nilai, dan fungsi agregat dapat digunakan untuk mengembalikan satu nilai untuk setiap kelompok.
<br><br>
Contoh simulasi perhitungannya adalah sebagai berikut :
<br><br>
<img src="https://wesmckinney.com/book/images/pda3_1001.png" width="25%" height="1%">

#### <i><b><span style='color:#55679C'>Quest</span> : Hitung dan tampilkan banyaknya customer tiap internet_type pada tabel telco_services? Urutkan dari yang jumlahnya terbesar hingga terkecil!</b></i>

In [ ]:
SELECT internet_type, COUNT(customer_id) AS jumlah_customer
FROM telco_churn.telco_services
GROUP BY internet_type
ORDER BY jumlah_customer DESC

bisa juga query sebagai berikut:
SELECT internet_type, COUNT(customer_id) AS jumlah_customer
FROM telco_churn.telco_services
GROUP BY internet_type
ORDER BY **2** DESC

Angka **2** menunjukkan urutan nama_kolom yang dipanggil, namun query ini tidak disarankan karena kurangnya keterbacaan

#### <i><b><span style='color:#55679C'>Quest</span> : Hitung dan tampilkan banyaknya customer tiap kategori offer dan internet_type pada tabel telco_services? Urutkan berdasarkan offer dan internet_type secara ascending!</b></i>

In [ ]:
SELECT offer, internet_type, COUNT(customer_id) AS jumlah_customer
FROM telco_churn.telco_services
GROUP BY offer, internet_type
ORDER BY offer ASC, internet_type ASC

#### <i><b><span style='color:#55679C'>Quest</span> : Tampilkan kolom phone_internet_type dan total_customer tiap tipe tersebut pada tabel telco_services lalu urutkan dari total_customer terbesar hingga terkecil, dengan ketentuan</b></i><br>
<ul>
<li>Jika customer menggunakan layanan Telepon & Internet, maka phone_internet_type = Phone & Internet</li>
<li>Jika customer menggunakan layanan Telepon namun tidak menggunakan layanan Internet, maka phone_internet_type = Phone Only</li>
<li>Jika customer tidak menggunakan layanan Telepon namun menggunakan layanan Internet, maka phone_internet_type = Internet Only</li>
<li>Jika customer tidak menggunakan kedua layanan tersebut, maka phone_internet_type = No Phone & Internet</li>
</ul>

In [ ]:
SELECT
CASE
  WHEN phone_service = true AND internet_service = true THEN 'Phone & Internet'
  WHEN phone_service = true AND internet_service = false THEN 'Phone Only'
  WHEN phone_service = false AND internet_service = true THEN 'Internet Only'
  ELSE 'No Phone & Internet'
END AS phone_internet_type,
COUNT(customer_id) AS total_customer
FROM telco_churn.telco_services
GROUP BY phone_service, internet_service
ORDER BY total_customer DESC

<a id="C"></a>
# <b>C. <span style='color:#0B2F9F'><code>HAVING</code></b>

HAVING dalam SQL digunakan untuk memfilter hasil dari kelompok data yang telah dikelompokkan dengan pernyataan GROUP BY. Mirip dengan klausa WHERE, tetapi HAVING bekerja setelah pengelompokan data dilakukan. Dengan kata lain, HAVING biasa digunakan untuk menerapkan kondisi pada hasil agregat.

#### <i><b><span style='color:#55679C'>Quest</span> : Pada tabel telco_services, hitung rata-rata tenure_in_month tiap banyaknya number_of_referrals. Tampilkan data yang rata-rata tenure_in_month kurang dari 40 bulan!</b></i>

In [ ]:
SELECT number_of_referrals, ROUND(AVG(tenure_in_months),2) AS avg_tenure_in_months
FROM telco_churn.telco_services
GROUP BY number_of_referrals
HAVING AVG(tenure_in_months) < 40

#### <i><b><span style='color:#55679C'>Quest</span> : Hitung dan tampilkan banyaknya customer tiap kategori offer dan internet_type pada tabel telco_services, namun hanya untuk customer yang menerima offer dan total banyak customer lebih dari sama dengan 100 pada kategori yang telah disebutkan!</b></i>

In [ ]:
SELECT offer, internet_type, COUNT(customer_id) AS total_customer
FROM telco_churn.telco_services
GROUP BY offer, internet_type
HAVING offer IS NOT NULL AND internet_type IS NOT NULL AND COUNT(customer_id) >= 100
ORDER BY offer ASC

* cara query lain: SELECT offer, internet_type, count(customer_id) as total_customer
from `telco_churn.telco_services`
WHERE offer IS NOT NULL
group by offer, internet_type
having total_customer >= 100
ORDER BY offer, internet_type

Data Source : <i>https://www.ibm.com/docs/en/cognos-analytics/11.1.0?topic=samples-telco-customer-churn</i>

---

<br>
<a href="https://www.linkedin.com/in/maria-ulina-klementine-manurung"><img src="https://img.shields.io/badge/-Â© 2025 Maria U.K. Manurung-417DAC?style=for-the-badge&logoColor=white"/></a>

<i>Powered by :</i><br><br>
<img src="https://dqlab.id/files/dqlab/cache/87e30118ebba5ec7d96f6ea8c9dcc10b_x_118_X_55.png">